Public Member Functions | Friends | List of all members
ACAPI::MEP::SystemGroup::Modifier Class Reference
MEP Element Manager
Modifier object for SystemGroup. More...
#include <MEPSystemGroup.hpp>
 Inheritance diagram for ACAPI::MEP::SystemGroup::Modifier:
 Public Member Functions
Result< void >  | SetName (const GS::UniString &name)
Sets the name of the SystemGroup.
Result< UniqueID >  | Add (const GS::UniString &name)
Creates and adds a new PhysicalSystem to the SystemGroup.
Result< void >  | Remove (const UniqueID &system)
Removes an existing PhysicalSystem from the SystemGroup.
 Friends
 class  | SystemGroup
Detailed Description
Modifier object for SystemGroup.
Since
Archicad 29
Member Function Documentation
◆ Add()
 Result< UniqueID > ACAPI::MEP::SystemGroup::Modifier::Add  |  ( |  const GS::UniString & |  name | )
Creates and adds a new PhysicalSystem to the SystemGroup.
Parameters
name | The name of the new PhysicalSystem.
Returns
The ID of the newly created PhysicalSystem if successful, otherwise an error
 std::optional<ACAPI::MEP::UniqueID> createdId;
 if (group.Modify ([&](ACAPI::MEP::SystemGroup::Modifier& modifier) -> GS::GSErrCode {
 const auto result { modifier.Add (suggestedName) };
 if (result.IsErr ())
 return result.UnwrapErr ().kind;
 createdId = result.Unwrap ();
 return NoError;
 }, "Create new system.").IsErr ())
 return {};
◆ Remove()
 Result< void > ACAPI::MEP::SystemGroup::Modifier::Remove  |  ( |  const UniqueID & |  system | )
Removes an existing PhysicalSystem from the SystemGroup.
Parameters
system | The ID of the PhysicalSystem to remove
Returns
Nothing if the PhysicalSystem was removed successfully, otherwise an error
◆ SetName()
 Result< void > ACAPI::MEP::SystemGroup::Modifier::SetName  |  ( |  const GS::UniString & |  name | )
Sets the name of the SystemGroup.
Parameters
name | The new name of the SystemGroup
Returns
Nothing if setting the name was successful, otherwise an error